### Pair Programming Pandas V

In [80]:
# Lo primero, importamos las librerías:

import pandas as pd
import numpy as np
import os
from os import getcwd

1. Cargad los tres ficheros nombrados anteriormente y los exploramos para familizarizarnos con ellos y saber que información tienen en común y debatir con tu compañera como podríamos juntar toda la información.

In [81]:
df_t = pd.read_csv("datos/04-attacks.csv",index_col=0)
df_t.head(3)

,Case Number,Unnamed: 0,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,HREF,Siglo
0,2018.06.25,0,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI
6,2018.06.03.a,6,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,M,18,Late afternoon,Tiger shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI
8,2018.05.26.b,8,2018.0,Unprovoked,USA,Florida,"Cocoa Beach, Brevard County",Walking,Cody High,M,15,17h00,"Bull shark, 6'",http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI

In [82]:
df_t_h = pd.read_csv("datos/05-attacks_historico.csv", index_col = 0)
df_t_h.head(3)

,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,...,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0,NaN,NaN
6133,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,...,NaN,The Observer 5/28/1797,1797.05.28.R-Cloverdale.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1797.05.28.R,1797.05.28.R,170.0,NaN,NaN
6134,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,M,NaN,...,NaN,"The Waterford Herald, 9/15/1792",1792.09.12-Thames.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1792.09.12,1792.09.12,169.0,NaN,NaN

In [83]:
df_t_a = pd.read_csv("datos//05-attacks_adicional.csv", index_col = 0)
df_t_a.head(3)

,Case Number,Fatal (Y/N),Injury,Date
0,2018.06.25,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.18,N,Minor injury to left thigh,18-Jun-2018
2,2018.06.09,N,Injury to left lower leg from surfboard skeg,09-Jun-2018

Chequead que los nombres de las columnas ver si se llaman iguales entre dataframes.

### Describe

In [84]:
nombre_tibu3_des = df_t.describe().T
nombre_tibuhistorico_des = df_t_h.describe().T
nombre_tibuadicional_des = df_t_a.describe().T

In [85]:
nombre_tibu3_des

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,1502.0,2169.600533,1336.383393,0.0,1096.25,1972.0,3112.0,5922.0
Year,1502.0,1991.604527,23.489506,1868.0,1978.00,2001.0,2009.0,2018.0

In [86]:
nombre_tibuhistorico_des

,count,mean,std,min,25%,50%,75%,max
Year,170.0,428.617647,744.448512,0.0,0.00,0.0,394.25,1800.0
original order,170.0,86.500000,49.218899,2.0,44.25,86.5,128.75,171.0
Unnamed: 22,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Unnamed: 23,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [87]:
nombre_tibuadicional_des

            count unique         top  freq
Case Number  6287   6287  2018.06.25     1
Fatal (Y/N)  5751      8           N  4284
Injury       6258   3729       FATAL   801
Date         6286   5431        1957    11

### Columns

In [88]:
nombre_tibu3_col = df_t.columns
nombre_tibuhistorico_col = df_t_h.columns
nombre_tibuadicional_col = df_t_a.columns

In [89]:
nombre_tibu3_col

Index(['Case Number', 'Unnamed: 0', 'Year', 'Type', 'Country', 'Area',
       'Location', 'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ',
       'HREF', 'Siglo'],
      dtype='object')

In [90]:
nombre_tibuhistorico_col

Index(['Case Number', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ',
       'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [91]:
nombre_tibuadicional_col

Index(['Case Number', 'Fatal (Y/N)', 'Injury', 'Date'], dtype='object')

### Shape

In [92]:
nombre_tibu3_shape = df_t.shape
nombre_tibuhistorico_shape = df_t_h.shape
nombre_tibuadicional_shape = df_t_a.shape

In [93]:
nombre_tibu3_shape

(1502, 15)

In [94]:
nombre_tibuhistorico_shape

(170, 21)

In [95]:
nombre_tibuadicional_shape

(6288, 4)

### Borramos las columnas Unnamed

In [96]:
df_t = df_t.drop(["Unnamed: 0"], axis = 1)
df_t.head(1)

,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,HREF,Siglo
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI

In [97]:
df_t_h = df_t_h.drop(["Unnamed: 22", "Unnamed: 23"], axis = 1)
df_t_h.head(1)

,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order
6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0

### Cambiamos el nombre a las columnas

In [98]:
lista_columnas = {col: col.strip().replace(" ", "_").lower() for col in df_t.columns}
df_t.rename(columns=lista_columnas, inplace=True)

In [99]:
df_t.head(1)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,siglo
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI

In [100]:

lista_columnas_historico = {col : col.strip().replace(" ", "_").lower() for col in df_t_h.columns}
df_t_h.rename(columns=lista_columnas_historico, inplace=True)

In [101]:
df_t_h.head(1)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,investigator_or_source,pdf,href_formula,href,case_number.1,case_number.2,original_order
6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0

In [102]:
lista_columnas_adicional = {col: col.strip().replace(" ", "_").lower() for col in df_t_a.columns}
df_t_a.rename(columns=lista_columnas_adicional, inplace=True)

In [103]:
df_t_a.head(1)

,case_number,fatal_(y/n),injury,date
0,2018.06.25,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018

- ¿Están todas en minúsculas? ¿Tienen espacios?

    Están corregidas y bien, como podemos ver:

In [104]:
df_t.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'time', 'species', 'href', 'siglo'],
      dtype='object')

In [105]:
df_t_h.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'time', 'species',
       'investigator_or_source', 'pdf', 'href_formula', 'href',
       'case_number.1', 'case_number.2', 'original_order'],
      dtype='object')

In [106]:
df_t_a.columns

Index(['case_number', 'fatal_(y/n)', 'injury', 'date'], dtype='object')

En este momento nos habremos dado cuenta que el DataFrame que generamos 
en el pair programming Pandas IV es similar al DataFrame de los datos historicos.
Si recordamos, eliminamos algunas columnas en la sesión III que no eran útiles,
pero esas columnas están todavía en el histórico. Si no fuera por eso podríamos 
unir esos dataframes. Realizad los cambios que creais necesarios para que los
dataframes sean iguales y luego juntadlos usando el mejor método.

In [107]:
# Comprobamos cómo son las columnas y decidimos hacer primero un pd.concat y luego un merge:

df_t.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'time', 'species', 'href', 'siglo'],
      dtype='object')

In [108]:
df_t_h.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'time', 'species',
       'investigator_or_source', 'pdf', 'href_formula', 'href',
       'case_number.1', 'case_number.2', 'original_order'],
      dtype='object')

In [109]:
df_t_a.columns

Index(['case_number', 'fatal_(y/n)', 'injury', 'date'], dtype='object')

In [110]:
df_concat = pd.concat([df_t,df_t_h], axis=0)
df_concat.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,siglo,investigator_or_source,pdf,href_formula,case_number.1,case_number.2,original_order
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI,NaN,NaN,NaN,NaN,NaN,NaN
6,2018.06.03.a,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,M,18,Late afternoon,Tiger shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI,NaN,NaN,NaN,NaN,NaN,NaN

Es el momento de unir la información de todos los ataques de tiburón que acabamos de crear con el DataFrame de información adicional. Debatid que método es el más correcto para unir toda esta información y ejecutadlo.

In [111]:
df_fin = df_concat.merge(df_t_a, how = "left", on= "case_number")
df_fin.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,...,siglo,investigator_or_source,pdf,href_formula,case_number.1,case_number.2,original_order,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,...,siglo-XXI,NaN,NaN,NaN,NaN,NaN,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.03.a,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,M,18,...,siglo-XXI,NaN,NaN,NaN,NaN,NaN,NaN,Y,FATAL,03-Jun-2018

In [112]:
df_fin.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'time', 'species', 'href', 'siglo',
       'investigator_or_source', 'pdf', 'href_formula', 'case_number.1',
       'case_number.2', 'original_order', 'fatal_(y/n)', 'injury', 'date'],
      dtype='object')

In [113]:
df_fin.shape

(1672, 23)

In [114]:
df_fin.describe()

              year  original_order
count  1672.000000      170.000000
mean   1832.688397       86.500000
std     528.969901       49.218899
min       0.000000        2.000000
25%    1964.000000       44.250000
50%    1997.000000       86.500000
75%    2008.000000      128.750000
max    2018.000000      171.000000

In [115]:
df_fin.to_csv("datos/05-attacks_union.csv")

In [116]:
leer = pd.read_csv("datos/05-attacks_union.csv", index_col=0)
leer.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,...,siglo,investigator_or_source,pdf,href_formula,case_number.1,case_number.2,original_order,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,...,siglo-XXI,NaN,NaN,NaN,NaN,NaN,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.03.a,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,M,18,...,siglo-XXI,NaN,NaN,NaN,NaN,NaN,NaN,Y,FATAL,03-Jun-2018